#include "modules/book.h"
#include "modules/menu.h"

/*
Управление данными в библиотеке
1 Определение общих классов
Создать класс Book с характеристиками книги, такими как название,
автор, жанр, и методами для работы с книгой.
2 Шаблоны
Реализовать шаблонный класс Pair для хранения пары характеристик
книги, например, <std::string, std::string> для названия книги и её
автора.
3 STL
Применить алгоритмы STL для управления каталогом библиотеки,
например, сортировки книг по автору.
4 ООП
Создать классы, наследующиеся от Book, представляющие разные
жанры литературы (например, Fiction, NonFiction).
Реализовать полиморфные методы для эффективной работы с разными
видами книг.
5 Меню и файлы
Разработать текстовое меню для пользователя с опциями добавления,
поиска, сортировки и вывода данных о книгах.
Сохранение результатов каждой операции в текстовый файл "output.txt"
для документирования.
6 Дополнительные задачи
Добавить функционал изменения данных о книгах (например,
изменение жанра).
Расширить сущности и функционал, например, добавив информацию о
наличии книг в библиотеке.
*/


int main()
{

}